## 1. University rankings

We look at university rankings based on multiple criteria in the years 2014-16.

In [1]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('misc/timesData.csv')

In [ ]:
df.head()

### Problems

* Find all the universities that were ranked in top 100 at least once.

 * Add a column called 'Staff' which shows the size of staff of each university. Derive this number from columns <code>student_staff_ratio</code> and <code>num_students</code>.

In [ ]:
df.columns

* Find the number of top-100 universties each country had in the year 2016. Sort them in descending order.

## 2. Tips

Each row of the tips dataset represents a meal at a restaurant. The columns give the value of the total bill and the tip and some information about the customer.

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset('tips')

In [ ]:
df.head()

* Calculate the average bill for each day.

* Find the fraction of smokers among men and women.

* Calculate the average size of the table when the bill was greater than \$20.

* List all the meals that were ordered on days when the average total bill was greater than 20. Hint: Use filter.

## 3. City of chicago employees

Below given is a dataset from a group of government employees from the city of Chicago.

In [ ]:
import numpy as np

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/gjreda/gregreda.com/master/content/notebooks/data/city-of-chicago-salaries.csv')

In [ ]:
df.head()

* Convert the salary column into a number.

In [ ]:
df.columns

In [ ]:
def ranker(df):
    """Assigns a rank to each employee based on salary, with 1 being the highest paid.
    Assumes the data is in descending order."""
    df['dept_rank'] = np.arange(len(df)) + 1
    return df

In [ ]:
chicago = df

In [ ]:
chicago.sort_values('Employee Annual Salary', ascending=False, inplace=True)
chicago = chicago.groupby('Department').apply(ranker)

## 4. IPL Analysis

This dataset contains information about all the IPL cricket matches till season 10.

* Using the ball_by_ball data find the maximum & average runs scored in the last 5 overs across all matches.

   Example using <code>agg</code> method

In [2]:
ball_by_ball = pd.read_csv("misc/ipl_ball_by_ball.csv")
ball_by_ball.head()

,MatcH_id,Over_id,Ball_id,Innings_No,Team_Batting,Team_Bowling,Striker_Batting_Position,Extra_Type,Runs_Scored,Extra_runs,...,Fielder_match_SK,Fielder_SK,Bowler_match_SK,BOWLER_SK,PlayerOut_match_SK,BattingTeam_SK,BowlingTeam_SK,Keeper_Catch,Player_out_sk,MatchDateSK
0,598028,15,6,1,5,2,6.0,No Extras,4,0,...,-1,-1,20343,82,-1,4,1,0,0,20130420
1,598028,14,1,1,5,2,5.0,No Extras,1,0,...,-1,-1,20348,345,-1,4,1,0,0,20130420
2,598028,14,2,1,5,2,3.0,No Extras,1,0,...,-1,-1,20348,345,-1,4,1,0,0,20130420
3,598028,14,3,1,5,2,5.0,No Extras,1,0,...,-1,-1,20348,345,-1,4,1,0,0,20130420
4,598028,14,4,1,5,2,3.0,No Extras,0,0,...,-1,-1,20348,345,-1,4,1,0,0,20130420

In [3]:
total_runs_last5 = ball_by_ball[ball_by_ball.Over_id>14].groupby(['MatcH_id','Over_id'])[['Runs_Scored']].sum()
total_runs_last5.groupby(level=1).agg([('max',np.max),('avg',np.mean)])

        Runs_Scored
                max        avg
Over_id
15               48  15.653907
16               42  15.902400
17               42  16.536232
18               42  16.776699
19               41  16.245098
20               43  15.049751

* For each match find the total number of runs scored and overs bowled

In [4]:
# Consider only innings 1 & 2
runs_overs = ball_by_ball[ball_by_ball.Innings_No<3].groupby(['MatcH_id','Innings_No'])
runs_overs.agg({'Over_id':(lambda x:x.nunique()),'Runs_Scored':np.sum}).groupby(level=0).sum()

          Over_id  Runs_Scored
MatcH_id
335987         36          268
335988         40          430
335989         36          240
335990         40          315
335991         38          184
335992         39          318
335993         34          268
335994         40          379
335995         40          418
335996         40          284
335997         38          264
335998         37          273
335999         32          289
336000         40          300
336001         40          332
336002         39          247
336003         40          356
336004         39          321
336005         40          321
336006         39          328
336007         39          320
336008         40          326
336009         39          281
336010         34          191
336011         39          226
336012         38          277
336013         33          188
336014         40          352
336015         32          242
336016         36          264
...           ...          ...
1082621        34          249
1082622        37          304
1082623        40          380
1082624        40          245
1082625        40          294
1082626        26          128
1082627        40          357
1082628        40          316
1082629        40          314
1082630        40          363
1082631        40          300
1082632        38          405
1082633        39          238
1082634        40          275
1082635        34          256
1082636        36          308
1082637        40          372
1082638        39          264
1082639        40          304
1082640        40          378
1082641        40          435
1082642        40          312
1082643        39          302
1082644        40          312
1082645        28          147
1082646        40          296
1082647        40          288
1082648        26          165
1082649        34          203
1082650        40          240

[636 rows x 2 columns]

In [ ]:
# Try an alternate way of solving the above question
# Code here...

* Find the top 5 venues for hosting the matches

In [5]:
matches = pd.read_csv("misc/ipl_matches.csv")
matches.head()

,Match_SK,match_id,Team1,Team2,match_date,Season_Year,Venue_Name,City_Name,Country_Name,Toss_Winner,match_winner,Toss_Name,Win_Type,Outcome_Type,ManOfMach,Win_Margin,Country_id
0,0,335987,Royal Challengers Bangalore,Kolkata Knight Riders,4/18/2008,2008,M Chinnaswamy Stadium,Bangalore,India,Royal Challengers Bangalore,Kolkata Knight Riders,field,runs,Result,BB McCullum,140.0,1
1,1,335988,Kings XI Punjab,Chennai Super Kings,4/19/2008,2008,"Punjab Cricket Association Stadium, Mohali",Chandigarh,India,Chennai Super Kings,Chennai Super Kings,bat,runs,Result,MEK Hussey,33.0,1
2,2,335989,Delhi Daredevils,Rajasthan Royals,4/19/2008,2008,Feroz Shah Kotla,Delhi,India,Rajasthan Royals,Delhi Daredevils,bat,wickets,Result,MF Maharoof,9.0,1
3,3,335990,Mumbai Indians,Royal Challengers Bangalore,4/20/2008,2008,Wankhede Stadium,Mumbai,India,Mumbai Indians,Royal Challengers Bangalore,bat,wickets,Result,MV Boucher,5.0,1
4,4,335991,Kolkata Knight Riders,Deccan Chargers,4/20/2008,2008,Eden Gardens,Kolkata,India,Deccan Chargers,Kolkata Knight Riders,bat,wickets,Result,DJ Hussey,5.0,1

In [ ]:
# Code here

* Find the top 5 match winning teams

In [ ]:
# Code here
# top5_win_teams =

* For the top 5 teams above find the mean, min and max winning margin when they played first

   Hint: use <code>agg</code> method

In [ ]:
# Code here

* In which venue has the team batting first won most number of matches

In [ ]:
# Code here

* In each season on average how many matches were played on each day

In [ ]:
# Code here

* Using ipl_ball_by_ball and matches dataset find the average runs scored in each venue innings wise

 Hint: Use merge method

In [ ]:
ball_by_ball.columns

In [ ]:
ball_by_ball.rename(columns={'MatcH_id':'match_id'},index=str,inplace=True)
# Code here

### 5. Stock data analysis

The below time series data contains Amazon's stock price movement for 17 years.

In [6]:
amzn = pd.read_csv('misc/AMZN.csv')
amzn.head()

         Date     Open     High        Low    Close  Adj Close    Volume
0  2000-01-03  81.5000  89.5625  79.046799  89.3750    89.3750  16117600
1  2000-01-04  85.3750  91.5000  81.750000  81.9375    81.9375  17487400
2  2000-01-05  70.5000  75.1250  68.000000  69.7500    69.7500  38457400
3  2000-01-06  71.3125  72.6875  64.000000  65.5625    65.5625  18752000
4  2000-01-07  67.0000  70.5000  66.187500  69.5625    69.5625  10505400

* Find the year wise average closing price 
   
  Hint: Use set_index, explore using functions in groupby method

In [7]:
amzn.Date = pd.to_datetime(amzn.Date)
amzn.dtypes

Date         datetime64[ns]
Open                float64
High                float64
Low                 float64
Close               float64
Adj Close           float64
Volume                int64
dtype: object

In [ ]:
# Code here

* For each date, find the consecutive price difference in 'Adj Close' for next 5 days for which the data is available

  Create 5 columns for day2-day1, day3-day2 etc..
  
  Hint: Use shift, diff methods

In [ ]:
# Code here

* For each day identify if there is a monotonic behaviour in the price movement over the next 5 days. 

    How many such days are there ?
  
    Hint: Use apply, is_monotonic_increasing methods

In [ ]:
# Code here

**For more examples **


- Tips dataset: https://www.drawingfromdata.com/filter-transform-group-with-pandas
- Kaggle https://www.kaggle.com/tejasreddy/pandas-tut-7-solution
- <code>.agg</code> function: https://pbpython.com/pandas-grouper-agg.html